In [1]:
import pandas as pd

In [2]:
file = "Resources/sampleData.csv"

In [3]:
original_df = pd.read_csv(file)
original_df.head()

   id first_name   last_name       Phone Number      Time zone
0   1      Peter  Richardson    7-(789)867-9023  Europe/Moscow
1   2     Janice       Berry   86-(614)973-1727    Asia/Harbin
2   3     Andrea      Hudson   86-(918)527-6371  Asia/Shanghai
3   4     Arthur    Mcdonald  420-(553)779-7783  Europe/Prague
4   5      Kathy     Morales  351-(720)541-2124  Europe/Lisbon

In [4]:
# Set new index to last_name
df = original_df.set_index("last_name")
df.head()

            id first_name       Phone Number      Time zone
last_name
Richardson   1      Peter    7-(789)867-9023  Europe/Moscow
Berry        2     Janice   86-(614)973-1727    Asia/Harbin
Hudson       3     Andrea   86-(918)527-6371  Asia/Shanghai
Mcdonald     4     Arthur  420-(553)779-7783  Europe/Prague
Morales      5      Kathy  351-(720)541-2124  Europe/Lisbon

In [5]:
# Grab the data contained within the "Berry" row and the "Phone Number" column
berry_phone = df.loc["Berry", "Phone Number"]
print("Using Loc: " + berry_phone)

also_berry_phone = df.iloc[1, 2]
print("Using Iloc: " + also_berry_phone)

Using Loc: 86-(614)973-1727
Using Iloc: 86-(614)973-1727

In [13]:
hudson_zone = df.loc["Hudson", "Time zone"]
hudson_zone

last_name
Hudson     Asia/Shanghai
Hudson    America/Bogota
Hudson     Europe/Lisbon
Name: Time zone, dtype: object

In [14]:
first_hudson_zone = df.loc["Hudson", "Time zone"][0]
first_hudson_zone

'Asia/Shanghai'

In [15]:
second_hudson_zone = df.loc["Hudson", "Time zone"][1]
second_hudson_zone

'America/Bogota'

In [26]:
# Show everything for the first column, id (index 0):
df.iloc[:,0]

last_name
Richardson      1
Berry           2
Hudson          3
Mcdonald        4
Morales         5
             ...
Henderson      96
Riley          97
Green          98
Peters         99
Murray        100
Name: id, Length: 100, dtype: int64

In [27]:
# Show everything for the second column (index 1):
df.iloc[:,1]

last_name
Richardson        Peter
Berry            Janice
Hudson           Andrea
Mcdonald         Arthur
Morales           Kathy
                ...
Henderson        Arthur
Riley         Christina
Green          Nicholas
Peters            Debra
Murray          Matthew
Name: first_name, Length: 100, dtype: object

In [28]:
# Show everything for the second row (index 1):
df.iloc[1,:]

id                             2
first_name                Janice
Phone Number    86-(614)973-1727
Time zone            Asia/Harbin
Name: Berry, dtype: object

In [29]:
# Show everything:
df.iloc[:,0:]

             id first_name       Phone Number      Time zone
last_name
Richardson    1      Peter    7-(789)867-9023  Europe/Moscow
Berry         2     Janice   86-(614)973-1727    Asia/Harbin
Hudson        3     Andrea   86-(918)527-6371  Asia/Shanghai
Mcdonald      4     Arthur  420-(553)779-7783  Europe/Prague
Morales       5      Kathy  351-(720)541-2124  Europe/Lisbon
...         ...        ...                ...            ...
Henderson    96     Arthur   81-(353)751-4060     Asia/Tokyo
Riley        97  Christina   93-(374)749-5085     Asia/Kabul
Green        98   Nicholas   86-(750)462-3375  Asia/Shanghai
Peters       99      Debra   86-(879)987-9025  Asia/Shanghai
Murray      100    Matthew  353-(195)215-1300  Europe/Dublin

[100 rows x 4 columns]

In [30]:
# Drop the first row, show all colums:
df.iloc[1:,0:]

            id first_name       Phone Number       Time zone
last_name
Berry        2     Janice   86-(614)973-1727     Asia/Harbin
Hudson       3     Andrea   86-(918)527-6371   Asia/Shanghai
Mcdonald     4     Arthur  420-(553)779-7783   Europe/Prague
Morales      5      Kathy  351-(720)541-2124   Europe/Lisbon
Reyes        6       Juan  507-(957)942-8540  America/Panama
...        ...        ...                ...             ...
Henderson   96     Arthur   81-(353)751-4060      Asia/Tokyo
Riley       97  Christina   93-(374)749-5085      Asia/Kabul
Green       98   Nicholas   86-(750)462-3375   Asia/Shanghai
Peters      99      Debra   86-(879)987-9025   Asia/Shanghai
Murray     100    Matthew  353-(195)215-1300   Europe/Dublin

[99 rows x 4 columns]

In [31]:
# Drop the first row, show every column up to but not including 3:
df.iloc[1:,0:3]

            id first_name       Phone Number
last_name
Berry        2     Janice   86-(614)973-1727
Hudson       3     Andrea   86-(918)527-6371
Mcdonald     4     Arthur  420-(553)779-7783
Morales      5      Kathy  351-(720)541-2124
Reyes        6       Juan  507-(957)942-8540
...        ...        ...                ...
Henderson   96     Arthur   81-(353)751-4060
Riley       97  Christina   93-(374)749-5085
Green       98   Nicholas   86-(750)462-3375
Peters      99      Debra   86-(879)987-9025
Murray     100    Matthew  353-(195)215-1300

[99 rows x 3 columns]

In [33]:
# Show everything for the third column (index 2) and beyond:
df.iloc[:, 2:]

                 Phone Number      Time zone
last_name
Richardson    7-(789)867-9023  Europe/Moscow
Berry        86-(614)973-1727    Asia/Harbin
Hudson       86-(918)527-6371  Asia/Shanghai
Mcdonald    420-(553)779-7783  Europe/Prague
Morales     351-(720)541-2124  Europe/Lisbon
...                       ...            ...
Henderson    81-(353)751-4060     Asia/Tokyo
Riley        93-(374)749-5085     Asia/Kabul
Green        86-(750)462-3375  Asia/Shanghai
Peters       86-(879)987-9025  Asia/Shanghai
Murray      353-(195)215-1300  Europe/Dublin

[100 rows x 2 columns]

In [34]:
# Grab the first five rows of data and the columns from "id" to "Phone Number"
# The problem with using "last_name" as the index is that the values are not unique so duplicates are returned
# If there are duplicates and loc[] is being used, Pandas will return an error
richardson_to_morales = df.loc[["Richardson", "Berry", "Hudson",
                                "Mcdonald", "Morales"], ["id", "first_name", "Phone Number"]]
print(richardson_to_morales)

print()

# Using iloc[] will not find duplicates since a numeric index is always unique
also_richardson_to_morales = df.iloc[0:4, 0:3]
print(also_richardson_to_morales)

            id first_name       Phone Number
last_name
Richardson   1      Peter    7-(789)867-9023
Richardson  25     Donald   62-(259)282-5871
Berry        2     Janice   86-(614)973-1727
Hudson       3     Andrea   86-(918)527-6371
Hudson       8    Frances   57-(752)864-4744
Hudson      90      Norma  351-(551)598-1822
Mcdonald     4     Arthur  420-(553)779-7783
Morales      5      Kathy  351-(720)541-2124

            id first_name       Phone Number
last_name
Richardson   1      Peter    7-(789)867-9023
Berry        2     Janice   86-(614)973-1727
Hudson       3     Andrea   86-(918)527-6371
Mcdonald     4     Arthur  420-(553)779-7783

In [43]:
# The following will select all rows for columns `first_name` and `Phone Number`
df.loc[:, ["first_name", "Phone Number"]].head()

           first_name       Phone Number
last_name
Richardson      Peter    7-(789)867-9023
Berry          Janice   86-(614)973-1727
Hudson         Andrea   86-(918)527-6371
Mcdonald       Arthur  420-(553)779-7783
Morales         Kathy  351-(720)541-2124

In [44]:
phone_name_df = df[["first_name", "Phone Number"]]
phone_name_df.head()

           first_name       Phone Number
last_name
Richardson      Peter    7-(789)867-9023
Berry          Janice   86-(614)973-1727
Hudson         Andrea   86-(918)527-6371
Mcdonald       Arthur  420-(553)779-7783
Morales         Kathy  351-(720)541-2124

In [45]:
# the following logic test/conditional statement returns a series of boolean values
named_billy = df["first_name"] == "Billy"
named_billy.head()

last_name
Richardson    False
Berry         False
Hudson        False
Mcdonald      False
Morales       False
Name: first_name, dtype: bool

In [46]:
# Loc and Iloc also allow for conditional statments to filter rows of data
# using Loc on the logic test above only returns rows where the result is True
only_billys = df.loc[df["first_name"] == "Billy", :]
print(only_billys)

print()

# Multiple conditions can be set to narrow down or widen the filter
only_billy_and_peter = df.loc[(df["first_name"] == "Billy") | (
    df["first_name"] == "Peter"), :]
print(only_billy_and_peter)

           id first_name      Phone Number       Time zone
last_name
Clark      20      Billy  62-(213)345-2549   Asia/Makassar
Andrews    23      Billy  86-(859)746-5367  Asia/Chongqing
Price      59      Billy  86-(878)547-7739   Asia/Shanghai

            id first_name      Phone Number       Time zone
last_name
Richardson   1      Peter   7-(789)867-9023   Europe/Moscow
Clark       20      Billy  62-(213)345-2549   Asia/Makassar
Andrews     23      Billy  86-(859)746-5367  Asia/Chongqing
Price       59      Billy  86-(878)547-7739   Asia/Shanghai

In [49]:
only_billy_and_id_20 = df.loc[(df["first_name"] == "Billy") & (
    df["id"] == 20), :]
print(only_billy_and_peter)

           id first_name      Phone Number      Time zone
last_name
Clark      20      Billy  62-(213)345-2549  Asia/Makassar

In [50]:
only_id_20 = df.loc[(df["id"] == 20)]
only_id_20

           id first_name      Phone Number      Time zone
last_name
Clark      20      Billy  62-(213)345-2549  Asia/Makassar